[{"id":"1754918903900342","title":"I like pie","body":"Like really really really really like pie.....hontou desu ka?xhmfm","author":"A pie lover"},{"id":"1754925277515547","title":"Garden Infrastructure that will increase growing productivity","body":"Im not going to go into super detail with each type, but want to quickly touch on the different types and purposes and if anyone has any specific questions or would like me to go into detail let me know, I don’t want to just ramble on. I am mostly going to discuss permanent to semi permanent infrastructure.Types of infrastructure: Perimeter walls, raised garden beds, vertical support, water management, composting systems, climate control, Storage?, pathways, wildlife stuff?.Perimeter walls: Whether it’s a fence to keep pets in your yard, or to keep strngers out of your yard, or to keep specific wildlife out of your garden, a perimeter fence is just a perimeter fence. If you need to install something, thingk about the sun, can you go for something that will allow light to still pass through to grow on the other sied of that wall, or if it’s a solid boundary, could you then atleast put up a trillis of some sort to the ngrow vertically. If you can optimise this then it doesn’t have to be a pain point.Raised garden beds: This could be a small raised structure using large tree branches, pallet wood or whatever, or could be large 600mm (12”) deep beds. The depth will depend on your budget for materials, what you plan to grow (for example salad greens have shallower roots than tomatoes, corn, or fruit trees. Another consideration would be whether you have soil to cultivate, for example if your space has concrete surface beds or if you are on a balcony, or even if you have contaminated soil. The last consideration would be your age and health, if you have a bad back then you would opt for a higher growing level preferably with a nice ledge to sit on while you work. Taller or climbing srops can always be planted out of the raised beds to not take up that valuable real-estate.Vertical growing or support: The first things that come to mind are stakes and trellises, honestly there are so many variations, from using cattle panels, to premade wooden trellises, to espalier wires, Florida weaves, arches, you name it. But there are a few others I want to explore, Using pallets that I have standling idle, I want to modify them and make a structure with say five levels of shallow growing containers (approx. 200mm to 300mm deep and wide), the structure would need to be braced for wind and eccentric loading. This way I can have green walls of crops, imagine a wall of strawberries, or lettuce, or beans. Not only will it free up ground space but then I will be able to position these structures in areas that would otherwise get more shade than required. This will also help with harvesting, protection as you can drape a shade cloth around for bids or insects, but it will also help with airflow and pest inspections. In areas that get enough sun, you could either make the structure higher or just simply leave a gap to then still cultivate deeper rooted plants as the base of the structures, or even then use those structures as a vertical support. If made with a nice wide base then these structures can also be placed on concrete surfaces.Water management: Water management is probably the most comprehensive item on this list as each type of water management solves a specific problem, and when planned and used effectively, I believe this can be a real game changer in the garden.Water Harvesting and storage: pretty self explanatory, but you essentially have some form of a storage container that is fed from pipes that will usually be connected to gutters along a roof. The more surface area where dew and rainwater can fall, the more water you harvest. You could harvest water only for the garden in the dry months or you could hold extra capacity to also feed into your household. Ultimately harvesting remains pretty much the same, but the system can store water in a manner of ways, a JOJO tank is the most obvious, but you could always have the system overflow connected to a well or borehole (please just check any local regulations before doing this as wells and borehole are fed from subsurface water reserves and you don’t want to introduce contaminants into the ground water, this feeds vast areas and could be a real issue if you end up contaminating the local water supply). Another way to harvest water is through the use of strategically placed holes, I buried a plasti pot with the intention to remove it and install an arch at a later stage, what happened is that this hole collected water from the rain or while watering the garden and created a localised area of well watered soils, herbaceous plants grew very well in this area as a result and its something I want to implement in other areas of the garden. You don’t want to specifically water the hole, it just acts as an extra highly localised reserve. The last storage option is through the use of ponds, they could be small ponds that you don’t even garden or have fish in, but obviously if executed well ,it can be multi-functinoal.Water irrigation: The next item is very common, simply you have a single main line that is connected to a tap or water storage tank, this main line will run through your garden and will have smaller branch pipes that will then be distributed to wherever they need to. In all cases the main line will pretty much be the same, the branch pipes are where the flexibility comes in, you could use pipes with spray nozzles, they could be a type of drip tape, or more simply the main line will lead to another tap where you could just connect a hose to water the farthest parts of the garden more easily.Water reticulation: This leads into the last type of water management and one Im very excited to explore. When I say water reticulation, im not really talking about water irrigation systems, but its kind of the same thing, so instead of water flowing through pipes to reach a desired location, you will instead have modification to the land to channel rainwater to those areas. This can be achieved through the used of channels dug into the ground like what I have here, or you could use swales if you have the space and contours for it. At the end of the day what this item seeks to achieve is by creating points of resistance or opening points of resistance you can direct the flow of rainwater to wherever you want in a passive manner. So this means that you could even strategically place pots, garden beds, large rocks or logs, soild mounds or whaterver to better direct rainwater. For places where you get a lot of soil erosion or runoff with not much water soaking into the ground, then you want to slow the flow of water, add gravel patches or create rain-gardens to better enable to earth to soak up the running water. This point is a really cool point to talk about and honestly I might make a video dedicated just to this and what excites me about this topic.","author":"Matthew"},{"id":"1755243055905408","title":"my frog","body":"Frogs are like little puppies, but they are frogs.","author":"an imposter"},{"id":"1761207939804292","title":"Hee Hee Ha Ha","body":"Lets do the Makaraina bra, hee hee ha ha. Why you no display main content in sidebar?","author":"A Silly Goose"},{"id":"176122672737910","title":"he hi ","body":"What a lame story bro\r\n","author":"slippy boi"},{"id":"1763016596554413","title":"TestID","body":"Generate ID from transformer layer","author":"testy boi"},{"id":"1763058297059736","title":"testing edit 1","body":"another test","author":"Imohtep"}]